# 3. Реализовать программу работы с органическими клетками. Необходимо создать класс Клетка. В его конструкторе
# инициализировать параметр, соответствующий количеству клеток (целое число). В классе должны быть реализованы методы
# перегрузки арифметических операторов: сложение (__add__()), вычитание (__sub__()), умножение (__mul__()), деление
# (__truediv__()).Данные методы должны применяться только к клеткам и выполнять увеличение, уменьшение, умножение и
# обычное (не целочисленное) деление клеток, соответственно. В методе деления должно осуществляться округление значения
# до целого числа.
# Сложение. Объединение двух клеток. При этом число ячеек общей клетки должно равняться сумме ячеек исходных двух клеток.
# Вычитание. Участвуют две клетки. Операцию необходимо выполнять только если разность количества ячеек двух клеток больше
# нуля, иначе выводить соответствующее сообщение.
# Умножение. Создается общая клетка из двух. Число ячеек общей клетки определяется как произведение количества ячеек этих
# двух клеток.
# Деление. Создается общая клетка из двух. Число ячеек общей клетки определяется как целочисленное деление количества
# ячеек этих двух клеток.
# В классе необходимо реализовать метод make_order(), принимающий экземпляр класса и количество ячеек в ряду. Данный
# метод позволяет организовать ячейки по рядам.
# Метод должен возвращать строку вида *****\n*****\n*****..., где количество ячеек между \n равно переданному аргументу.
# Если ячеек на формирование ряда не хватает, то в последний ряд записываются все оставшиеся.
# Например, количество ячеек клетки равняется 12, количество ячеек в ряду — 5. Тогда метод make_order()
# вернет строку: *****\n*****\n**.
# Или, количество ячеек клетки равняется 15, количество ячеек в ряду — 5.
# Тогда метод make_order() вернет строку: *****\n*****\n*****.


class OrganicCell:

    def __init__(self, num):
        self.num = num

    def __add__(self, other):
        return OrganicCell(self.num + other.num)

    def __sub__(self, other):
        sub = self.num - other.num
        if sub > 0:
            return OrganicCell(sub)
        else:
            print('The difference in the number of cells must be greater than 0')

    def __mul__(self, other):
        return OrganicCell(self.num * other.num)

    def __str__(self):
        return str(self.num)

    def __truediv__(self, other):
        try:
            return OrganicCell(int(self.num / other.num))
        except ZeroDivisionError:
            print("Division by 0")

    def make_order(self, cells_in_row):
        return '\n'.join('*' * (self.num - i) if i + cells_in_row > self.num else '*' * cells_in_row
                         for i in range(0, self.num) if i % cells_in_row == 0)


cell_one = OrganicCell(23)

print(cell_one.make_order(5))

cell_two = OrganicCell(40)

print(cell_one + cell_two, end='\n')
print(cell_one - cell_two, end='\n')
print(cell_two - cell_one, end='\n')
print(cell_one * cell_two, end='\n')
print(cell_one / cell_two, end='\n')